#Задача 2: Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали S журавликов. 
#Сколько журавликов сделал каждый ребенок,если известно, что Петя и Сережа сделали одинаковое количество журавликов,
#а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?

s = int(input('введите количество сделанных журавликов:'))

print(f"количество журавликов сделанных Петей равно: {int(s/6)}")
print(f"количество журавликов сделанных Сережей равно: {int(s/6)}")
print(f"количество журавликов сделанных Катей равно: {int(s*2/3)}")





